SpaceCapsule/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wedge0
    {
        type            wedge;
        physicalType    patch;
        nFaces          3223;
        startFace       4761;
    }
    vehicle
    {
        type            wall;
        physicalType    patch;
        nFaces          45;
        startFace       7984;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       8029;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       8039;
    }
    wedge1
    {
        type            wedge;
        physicalType    patch;
        nFaces          3223;
        startFace       8049;
    }
    tunnel
    {
        type            slip;
        physicalType    patch;
        nFaces          20;
        startFace       11272;
    }
)

// ************************************************************************* //
