SpaceCapsule/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../inputs"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $speed;

boundaryField
{
    inlet
    {
        type            supersonicFreestream;
        pInf            $pressure;
        TInf            $temperature;
        UInf            $speed;
        gamma           1.4; // Specific heat ratio
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    front_and_back
    {
        type            empty;
    }

    vehicle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    tunnel
    {
        type            slip;
    }
    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
}

// ************************************************************************* //
