SpaceCapsule/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    // // Default 2nd order
    // div(phi,U)      Gauss limitedLinearV 1;
    // div(phi,e)      Gauss limitedLinear 1;
    // div(phid,p)     Gauss limitedLinear 1;
    // div(phi,K)      Gauss limitedLinear 1;
    // div(phiv,p)     Gauss limitedLinear 1;
    
    // Upwind 1st order
    default         Gauss upwind;

    // Upwind 2nd order
    // div(phi,U)      Gauss linearUpwind grad(U);
    // div(phi,e)      Gauss linearUpwind grad(e);
    // div(phid,p)     Gauss linearUpwind grad(p);
    // div(phi,K)      Gauss linearUpwind grad(K);
    // div(phiv,p)     Gauss linearUpwind grad(p);

    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
